{
    "albums":[
        {
            "artist":"IDLES",
            "albumName":"CRAWLER",
            "shortname": "crawler",
            "releaseDate": "2021",
            "summary": "Crawler was released on 12 November 2021 through Partisan Records, and was met with critical acclaim. Matt Mitchell, writing for Paste, gave the album an 8.8 out of 10 saying that Crawler 'is magnetic storytelling tempered with newfound patience'. Damien Morris, of The Observer, called Crawler a 'thrilling, glass-gargling introspection', giving the album a full five out of five stars. Stuart Berman of Pitchfork gave Crawler a 7 out 10, the highest rating the band has received by the website. Berman said that 'the Bristol band’s fourth album plays like the dark origin story for how Idles became the preeminent life coaches of modern post-punk.'",
            "tracklist":["MTT 420 RR", "The Wheel", "When the Lights Come On", "Car Crash", "The New Sensation", "Stockholm Syndrome", "The Beachland Ballroom", "Crawl!", "Meds", "Kelechi", "Progress", "Wizz", "King Snake", "The End"],
            "albumAM": "https://music.apple.com/us/album/crawler/1571499413",
            "albumSM": "https://open.spotify.com/album/1WXcTQXt1jeF5VGUNAeySv?si=Ut8eDE8MQXmYqpYJJY9ITw"

        },
        {
            "artist":"IDLES",
            "albumName":"Ultra Mono",
            "shortname": "ultra_mono",
            "releaseDate": "2020",
            "summary": "Ultra Mono is the third studio album by British rock band Idles, released on 25 September 2020 by Partisan Records. Following on from their previous album Joy as an Act of Resistance, the album further explores themes established in the band's previous works such as critique of capitalism, revolution, class struggle, mental health and toxic masculinity, as well as the positive and negative aspects of the band's newfound fame.",
            "tracklist":["War", "Grounds", "Mr. Motivator", "Anxiety", "Kill Them With Kindness", "Model Village", "Ne Touche Pas Moi", "Carcinogenic", "Reigns", "The Lover", "A Hymn", "Danke"],
            "albumAM": "https://music.apple.com/us/album/ultra-mono/1517502945",
            "albumSM": "https://open.spotify.com/album/0ojQHzflxMs6SfvBBkRKt6?si=X1hY8We_SyusPFmWORjLGQ"

        },
        {
            "artist":"IDLES",
            "albumName":"Joy as an Act of Resistance",
            "shortname": "joy_as_an_act_of_resistance",
            "releaseDate": "2018",
            "summary": "Joy as an Act of Resistance is the second studio album by British rock band Idles, released on 31 August 2018 by Partisan Records. Following the success of their debut album Brutalism, the band started recording new material for their next album. Taking inspiration from the similarly titled 2008 poem by Toi Derricotte, Joy as an Act of Resistance tells stories from Joe Talbot's troubled past and lyrics that deal with toxic masculinity, love, self-love, immigration, Brexit, and class. The album garnered critical acclaim from critics. Joy as an Act of Resistance peaked at number 5 on the UK Albums Chart and spawned two official singles: 'Danny Nedelko' and 'Never Fight a Man with a Perm'. ",
            "tracklist":["Colossus", "Never Fight A Man With A Perm", "I'm Scum", "Danny Nedelko", "Love Song", "June", "Samaritans", "Television", "Great", "Gram Rock", "Cry To Me", "Rottweiler"],
            "albumAM": "https://music.apple.com/us/album/joy-as-an-act-of-resistance/1392354930",
            "albumSM": "https://open.spotify.com/album/7BbRSUBwTB37ut0Ht3yAqt?si=-1JIk0k8RNeVAbpOhRRjpA"

        },
        {
            "artist":"IDLES",
            "albumName":"Brutalism",
            "shortname": "brutalism",
            "releaseDate": "2017",
            "summary": "Brutalism is the debut studio album by British rock band Idles, released in March 2017.The band started recording the album in 2015.Singer Joe Talbot's mother (who is pictured on the album cover along with a sculpture by Talbot and his father) died during the recording of the album after a long illness, and his time caring for her, and her death, had a major impact on the album, with Talbot later stating 'She was that album. That's why she was on the cover.' Talbot added lyrics after the music had been written by the rest of the band. He stated the songs on the album are 'to do with the roles of women in my life. It's also to do with the role my mum played pre and postmortem and also about progression and grief as a theme and eventual rebuilding'. The band recorded the album largely live in the studio, with each song recorded three times at most in order to keep a raw and urgent feel to them. It was produced by Space.",
            "tracklist":["Heel/Heal", "Well Done", "Mother", "Date Night", "Faith in the City", "1049 Gotho", "Divide & Conquer", "Rachel Khoo", "Stendhal Syndrome", "Exeter","Benzocaine", "White Privilege", "Slow Savage"],
            "albumAM": "https://music.apple.com/us/album/brutalism/1349468096",
            "albumSM": "https://open.spotify.com/album/3VrfVLndSkH81aE4CqivdI?si=ToNMDcazS1-L7lVhtuPNvw"

        }
    ]
}

